# Shared Homebrew layer for every uinaf Mac.
# Install with one profile:
#   ./scripts/brew-bundle.sh personal
#   ./scripts/brew-bundle.sh devbox

# Taps
tap "1password/tap"
tap "f1bonacc1/tap"
tap "teamookla/speedtest"
tap "uinaf/tap"

# Terminal, browser, and agent apps
cask "ghostty"
cask "zed"
cask "google-chrome"
cask "1password-cli"
cask "codex"
cask "claude-code"

# Core CLI
brew "git"
brew "gh"
brew "mise"
brew "direnv"
brew "btop"
brew "ripgrep"
brew "git-crypt"
brew "git-filter-repo"
brew "actionlint"
brew "shellcheck"
brew "aria2"
brew "awscli"
brew "ffmpeg"
brew "mole"
brew "xcodes"

# Containers
brew "colima"
brew "docker"
brew "docker-buildx"
brew "docker-compose"

# Networking and diagnostics
brew "fping"
brew "mtr"
brew "teamookla/speedtest/speedtest"

# Security
brew "gitleaks"
brew "trufflehog"

# uinaf tools
brew "uinaf/tap/tccutil-rs"

# Process supervision
brew "f1bonacc1/tap/process-compose"
