# Taps
tap "1password/tap"
tap "chill-institute/tap"
tap "jesseduffield/lazydocker"
tap "openclaw/tap"
tap "putdotio/tap"
tap "steipete/tap"
tap "teamookla/speedtest"
tap "uinaf/tap"

# Terminal and editors
cask "ghostty"
cask "zed"

# Browser and auth
cask "google-chrome"
cask "firefox"
cask "brave-browser"
cask "1password"
cask "1password-cli"
cask "google-drive"
cask "yubico-authenticator"

# Networking
cask "tailscale-app"
cask "proxyman"

# Communication
cask "slack"
cask "discord"
cask "telegram"
cask "zoom"

# Agent tools
cask "codex"
cask "codex-app"
cask "claude-code"
cask "codexbar"

# Design and work apps
cask "raycast"
cask "figma"
cask "linear"
cask "cleanshot"
cask "screen-studio"

# Platform development
cask "xcodes-app"
cask "android-studio"
cask "raspberry-pi-imager"

# Media and utilities
cask "handbrake-app"
cask "imageoptim"
cask "parsec"
cask "the-unarchiver"
cask "vlc"

# Core CLI
brew "git"
brew "gh"
brew "mise"
brew "direnv"
brew "btop"
brew "ripgrep"
brew "git-crypt"
brew "git-filter-repo"
brew "actionlint"
brew "shellcheck"
brew "aria2"
brew "awscli"
brew "ffmpeg"
brew "gradle"
brew "mole"
brew "ykman"

# Containers
brew "colima"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "lazydocker"

# Networking and diagnostics
brew "fping"
brew "mtr"
brew "speedtest"

# Security
brew "gitleaks"
brew "trufflehog"

# uinaf tools
brew "uinaf/tap/tccutil-rs"

# Project tools
brew "chill-institute/tap/chilly"
brew "openclaw/tap/crabbox"
brew "putdotio/tap/putio-cli"
