# Shared Homebrew layer for every uinaf Mac.
# Install with one profile:
#   ./scripts/brew-bundle.sh personal
#   ./scripts/brew-bundle.sh devbox

# Taps
tap "1password/tap"
tap "f1bonacc1/tap"
tap "teamookla/speedtest"
tap "uinaf/tap"

# Core CLI
brew "git"
brew "gh"
brew "mise"
brew "direnv"
brew "btop"
brew "ripgrep"
brew "git-crypt"
brew "git-filter-repo"
brew "actionlint"
brew "shellcheck"
brew "aria2"
brew "awscli"
brew "ffmpeg"
brew "mole"

# Networking and diagnostics
brew "fping"
brew "mtr"
brew "teamookla/speedtest/speedtest"

# Security
brew "gitleaks"
brew "trufflehog"

# uinaf tools
brew "uinaf/tap/tccutil-rs"

# Process supervision
brew "f1bonacc1/tap/process-compose"
